const Joi = require('joi');

const schoolsValidator = (schema) => (payload) => 
    schema.validate(payload, { abortEarly: false });

const registerSchema = Joi.object({
    email: Joi.string().email().required(),
    password: Joi.string().pattern(new RegExp('^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{6,20}$')).required(),
    name: Joi.string().max(50).required(),
    district: Joi.string().valid("Νομός Αθηνών", "Νομός Αιτωλοακαρνανίας", "Νομός Ανατολικής Αττικής", "Νομός Αργολίδας", "Νομός Αρκαδίας", "Νομός Άρτας", "Νομός Αχαΐας", 
                                "Νομός Βοιωτίας", "Νομός Γρεβενών", "Νομός Δράμας", "Νομός Δυτικής Αττικής", "Νομός Δωδεκανήσου", "Νομός Έβρου", "Νομός Ευβοίας", "Νομός Ευρυτανίας", 
                                "Νομός Ζακύνθου", "Νομός Ηλείας", "Νομός Ημαθίας", "Νομός Ηρακλείου", "Νομός Θεσπρωτίας", "Νομός Θεσσαλονίκης", "Νομός Ιωαννίνων", "Νομός Καβάλας", 
                                "Νομός Καρδίτσας", "Νομός Καστοριάς", "Νομός Κέρκυρας", "Νομός Κεφαλληνίας", "Νομός Κιλκίς", "Νομός Κοζάνης", "Νομός Κορινθίας", "Νομός Κυκλάδων", 
                                "Νομός Λακωνίας", "Νομός Λάρισας", "Νομός Λασιθίου", "Νομός Λέσβου", "Νομός Λευκάδας", "Νομός Μαγνησίας", "Νομός Μεσσηνίας", "Νομός Ξάνθης", "Νομός Πειραιά", 
                                "Νομός Πέλλας", "Νομός Πιερίας", "Νομός Πρέβεζας", "Νομός Ρεθύμνης", "Νομός Ροδόπης", "Νομός Σάμου", "Νομός Σερρών", "Νομός Τρικάλων", "Νομός Φθιώτιδας", 
                                "Νομός Φλώρινας", "Νομός Φωκίδας", "Νομός Χαλκιδικής", "Νομός Χανίων", "Νομός Χίου"),
    town: Joi.string().max(50),
    address: Joi.string().max(50),
    phone: Joi.string().pattern(new RegExp('^[0-9]{10}$'))
});

exports.validateRegistration = schoolsValidator(registerSchema);